Revit 2026 API

# DimensionTypeAlternateUnitsSuffix Property

---

The suffix text for the alternate units value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string AlternateUnitsSuffix { get; set; }
```
```vb
Public Property AlternateUnitsSuffix As String
	Get
	Set
```
```cpp
public:
property String^ AlternateUnitsSuffix {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member AlternateUnitsSuffix : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

DimensionType Class

Autodesk.Revit.DB Namespace